GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F56Q71.inc
;----- OPA1CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
PTRES            EQU  H'0004'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA1OFCST        EQU  H'0002'
OPA1PTRES        EQU  H'0004'
OPA1OFCSEL0      EQU  H'0000'
OPA1OFCSEL1      EQU  H'0001'


;----- OPA1HWC Bits -----------------------------------------------------
ORPOL            EQU  H'0003'
OREN             EQU  H'0007'
HWCL0            EQU  H'0000'
HWCL1            EQU  H'0001'
HWCL2            EQU  H'0002'
HWCH0            EQU  H'0004'
HWCH1            EQU  H'0005'
HWCH2            EQU  H'0006'
OPA1ORPOL        EQU  H'0003'
OPA1OREN         EQU  H'0007'
OPA1HWCL0        EQU  H'0000'
OPA1HWCL1        EQU  H'0001'
OPA1HWCL2        EQU  H'0002'
OPA1HWCH0        EQU  H'0004'
OPA1HWCH1        EQU  H'0005'
OPA1HWCH2        EQU  H'0006'


;----- OPA1OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA1OFFSET0      EQU  H'0000'
OPA1OFFSET1      EQU  H'0001'
OPA1OFFSET2      EQU  H'0002'
OPA1OFFSET3      EQU  H'0003'
OPA1OFFSET4      EQU  H'0004'
OPA1OFFSET5      EQU  H'0005'
OPA1OFFSET6      EQU  H'0006'
OPA1OFFSET7      EQU  H'0007'


;----- OPA1ORS Bits -----------------------------------------------------
ORS0             EQU  H'0000'
ORS1             EQU  H'0001'
ORS2             EQU  H'0002'
ORS3             EQU  H'0003'
ORS4             EQU  H'0004'
ORS5             EQU  H'0005'
ORS6             EQU  H'0006'
ORS7             EQU  H'0007'
OPA1ORS0         EQU  H'0000'
OPA1ORS1         EQU  H'0001'
OPA1ORS2         EQU  H'0002'
OPA1ORS3         EQU  H'0003'
OPA1ORS4         EQU  H'0004'
OPA1ORS5         EQU  H'0005'
OPA1ORS6         EQU  H'0006'
OPA1ORS7         EQU  H'0007'


;----- OPA2CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
CPON_OPA2CON0    EQU  H'0005'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA2UG           EQU  H'0003'
OPA2CPON         EQU  H'0005'
OPA2EN           EQU  H'0007'


;----- OPA2CON1 Bits -----------------------------------------------------
RESON            EQU  H'0003'
NSS0             EQU  H'0000'
NSS1             EQU  H'0001'
NSS2             EQU  H'0002'
GSEL0            EQU  H'0004'
GSEL1            EQU  H'0005'
GSEL2            EQU  H'0006'
OPA2RESON        EQU  H'0003'
OPA2NSS0         EQU  H'0000'
OPA2NSS1         EQU  H'0001'
OPA2NSS2         EQU  H'0002'
OPA2GSEL0        EQU  H'0004'
OPA2GSEL1        EQU  H'0005'
OPA2GSEL2        EQU  H'0006'


;----- OPA2CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
NCH0_OPA2CON2    EQU  H'0004'
NCH1_OPA2CON2    EQU  H'0005'
NCH2_OPA2CON2    EQU  H'0006'
OPA2PCH0         EQU  H'0000'
OPA2PCH1         EQU  H'0001'
OPA2PCH2         EQU  H'0002'
OPA2NCH0         EQU  H'0004'
OPA2NCH1         EQU  H'0005'
OPA2NCH2         EQU  H'0006'


;----- OPA2CON3 Bits -----------------------------------------------------
INTOE            EQU  H'0005'
PSS0_OPA2CON3    EQU  H'0000'
PSS1_OPA2CON3    EQU  H'0001'
FMS0             EQU  H'0006'
FMS1             EQU  H'0007'
OPA2INTOE        EQU  H'0005'
OPA2PSS0         EQU  H'0000'
OPA2PSS1         EQU  H'0001'
OPA2FMS0         EQU  H'0006'
OPA2FMS1         EQU  H'0007'


;----- OPA2CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
PTRES            EQU  H'0004'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA2OFCST        EQU  H'0002'
OPA2PTRES        EQU  H'0004'
OPA2OFCSEL0      EQU  H'0000'
OPA2OFCSEL1      EQU  H'0001'


;----- OPA2HWC Bits -----------------------------------------------------
ORPOL            EQU  H'0003'
OREN             EQU  H'0007'
HWCL0            EQU  H'0000'
HWCL1            EQU  H'0001'
HWCL2            EQU  H'0002'
HWCH0            EQU  H'0004'
HWCH1            EQU  H'0005'
HWCH2            EQU  H'0006'
OPA2ORPOL        EQU  H'0003'
OPA2OREN         EQU  H'0007'
OPA2HWCL0        EQU  H'0000'
OPA2HWCL1        EQU  H'0001'
OPA2HWCL2        EQU  H'0002'
OPA2HWCH0        EQU  H'0004'
OPA2HWCH1        EQU  H'0005'
OPA2HWCH2        EQU  H'0006'


;----- OPA2OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA2OFFSET0      EQU  H'0000'
OPA2OFFSET1      EQU  H'0001'
OPA2OFFSET2      EQU  H'0002'
OPA2OFFSET3      EQU  H'0003'
OPA2OFFSET4      EQU  H'0004'
OPA2OFFSET5      EQU  H'0005'
OPA2OFFSET6      EQU  H'0006'
OPA2OFFSET7      EQU  H'0007'


;----- OPA2ORS Bits -----------------------------------------------------
ORS0             EQU  H'0000'
ORS1             EQU  H'0001'
ORS2             EQU  H'0002'
ORS3             EQU  H'0003'
ORS4             EQU  H'0004'
OPA2ORS0         EQU  H'0000'
OPA2ORS1         EQU  H'0001'
OPA2ORS2         EQU  H'0002'
OPA2ORS3         EQU  H'0003'
OPA2ORS4         EQU  H'0004'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


