GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F56Q71.inc
;----- APMPER Bits -----------------------------------------------------
PER0             EQU  H'0000'
PER1             EQU  H'0001'
PER2             EQU  H'0002'
PER3             EQU  H'0003'
PER4             EQU  H'0004'
PER5             EQU  H'0005'
PER6             EQU  H'0006'
PER7             EQU  H'0007'
APMPER0          EQU  H'0000'
APMPER1          EQU  H'0001'
APMPER2          EQU  H'0002'
APMPER3          EQU  H'0003'
APMPER4          EQU  H'0004'
APMPER5          EQU  H'0005'
APMPER6          EQU  H'0006'
APMPER7          EQU  H'0007'


;----- APMPERH Bits -----------------------------------------------------
PER8             EQU  H'0000'
PER9             EQU  H'0001'
PER10            EQU  H'0002'
PER11            EQU  H'0003'
PER12            EQU  H'0004'
PER13            EQU  H'0005'
PER14            EQU  H'0006'
PER15            EQU  H'0007'
APMPER8          EQU  H'0000'
APMPER9          EQU  H'0001'
APMPER10         EQU  H'0002'
APMPER11         EQU  H'0003'
APMPER12         EQU  H'0004'
APMPER13         EQU  H'0005'
APMPER14         EQU  H'0006'
APMPER15         EQU  H'0007'


;----- APMPERS1 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERS1_2       EQU  H'0002'
APMPERS1_3       EQU  H'0003'
APMPERS1_4       EQU  H'0004'
APMPERS1_5       EQU  H'0005'
APMPERS1_6       EQU  H'0006'
APMPERS1_7       EQU  H'0007'


;----- APMPERS1H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERS1_8       EQU  H'0000'
APMPERS1_9       EQU  H'0001'
APMPERS1_10      EQU  H'0002'
APMPERS1_11      EQU  H'0003'
APMPERS1_12      EQU  H'0004'
APMPERS1_13      EQU  H'0005'
APMPERS1_14      EQU  H'0006'
APMPERS1_15      EQU  H'0007'


;----- APMPERS2 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERS2_2       EQU  H'0002'
APMPERS2_3       EQU  H'0003'
APMPERS2_4       EQU  H'0004'
APMPERS2_5       EQU  H'0005'
APMPERS2_6       EQU  H'0006'
APMPERS2_7       EQU  H'0007'


;----- APMPERS2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERS2_8       EQU  H'0000'
APMPERS2_9       EQU  H'0001'
APMPERS2_10      EQU  H'0002'
APMPERS2_11      EQU  H'0003'
APMPERS2_12      EQU  H'0004'
APMPERS2_13      EQU  H'0005'
APMPERS2_14      EQU  H'0006'
APMPERS2_15      EQU  H'0007'


;----- APMPERE1 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERE1_2       EQU  H'0002'
APMPERE1_3       EQU  H'0003'
APMPERE1_4       EQU  H'0004'
APMPERE1_5       EQU  H'0005'
APMPERE1_6       EQU  H'0006'
APMPERE1_7       EQU  H'0007'


;----- APMPERE1H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERE1_8       EQU  H'0000'
APMPERE1_9       EQU  H'0001'
APMPERE1_10      EQU  H'0002'
APMPERE1_11      EQU  H'0003'
APMPERE1_12      EQU  H'0004'
APMPERE1_13      EQU  H'0005'
APMPERE1_14      EQU  H'0006'
APMPERE1_15      EQU  H'0007'


;----- APMPERE2 Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERE2_2       EQU  H'0002'
APMPERE2_3       EQU  H'0003'
APMPERE2_4       EQU  H'0004'
APMPERE2_5       EQU  H'0005'
APMPERE2_6       EQU  H'0006'
APMPERE2_7       EQU  H'0007'


;----- APMPERE2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMPERE2_8       EQU  H'0000'
APMPERE2_9       EQU  H'0001'
APMPERE2_10      EQU  H'0002'
APMPERE2_11      EQU  H'0003'
APMPERE2_12      EQU  H'0004'
APMPERE2_13      EQU  H'0005'
APMPERE2_14      EQU  H'0006'
APMPERE2_15      EQU  H'0007'


;----- APMCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
APMCLK0          EQU  H'0000'
APMCLK1          EQU  H'0001'


;----- APMSTATUS Bits -----------------------------------------------------
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMSTATUS_2      EQU  H'0002'
APMSTATUS_3      EQU  H'0003'
APMSTATUS_4      EQU  H'0004'
APMSTATUS_5      EQU  H'0005'
APMSTATUS_6      EQU  H'0006'
APMSTATUS_7      EQU  H'0007'


;----- APMSTATUSH Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
DAC3             EQU  H'0004'
CMP1             EQU  H'0005'
CMP2             EQU  H'0006'
ZCD              EQU  H'0007'
APMSTATUS_8      EQU  H'0000'
APMSTATUS_9      EQU  H'0001'
APMSTATUS_10     EQU  H'0002'
APMSTATUS_11     EQU  H'0003'
APMSTATUS_12     EQU  H'0004'
APMSTATUS_13     EQU  H'0005'
APMSTATUS_14     EQU  H'0006'
APMSTATUS_15     EQU  H'0007'


;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


