GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F56Q71.inc
;----- CONFIG7 Options --------------------------------------------------
_BBSIZE_BBSIZE_16384_7 EQU  H'7F'; Boot Block size is 16384 words
_BBSIZE_BBSIZE_16256_7 EQU  H'7E'; Boot Block size is 16256 words
_BBSIZE_BBSIZE_16128_7 EQU  H'7D'; Boot Block size is 16128 words
_BBSIZE_BBSIZE_16000_7 EQU  H'7C'; Boot Block size is 16000 words
_BBSIZE_BBSIZE_15872_7 EQU  H'7B'; Boot Block size is 15872 words
_BBSIZE_BBSIZE_15744_7 EQU  H'7A'; Boot Block size is 15744 words
_BBSIZE_BBSIZE_15616_7 EQU  H'79'; Boot Block size is 15616 words
_BBSIZE_BBSIZE_15488_7 EQU  H'78'; Boot Block size is 15488 words
_BBSIZE_BBSIZE_15360_7 EQU  H'77'; Boot Block size is 15360 words
_BBSIZE_BBSIZE_15232_7 EQU  H'76'; Boot Block size is 15232 words
_BBSIZE_BBSIZE_15104_7 EQU  H'75'; Boot Block size is 15104 words
_BBSIZE_BBSIZE_14976_7 EQU  H'74'; Boot Block size is 14976 words
_BBSIZE_BBSIZE_14848_7 EQU  H'73'; Boot Block size is 14848 words
_BBSIZE_BBSIZE_14720_7 EQU  H'72'; Boot Block size is 14720 words
_BBSIZE_BBSIZE_14592_7 EQU  H'71'; Boot Block size is 14592 words
_BBSIZE_BBSIZE_14464_7 EQU  H'70'; Boot Block size is 14464 words
_BBSIZE_BBSIZE_14336_7 EQU  H'6F'; Boot Block size is 14336 words
_BBSIZE_BBSIZE_14208_7 EQU  H'6E'; Boot Block size is 14208 words
_BBSIZE_BBSIZE_14080_7 EQU  H'6D'; Boot Block size is 14080 words
_BBSIZE_BBSIZE_13952_7 EQU  H'6C'; Boot Block size is 13952 words
_BBSIZE_BBSIZE_13824_7 EQU  H'6B'; Boot Block size is 13824 words
_BBSIZE_BBSIZE_13696_7 EQU  H'6A'; Boot Block size is 13696 words
_BBSIZE_BBSIZE_13568_7 EQU  H'69'; Boot Block size is 13568 words
_BBSIZE_BBSIZE_13440_7 EQU  H'68'; Boot Block size is 13440 words
_BBSIZE_BBSIZE_13312_7 EQU  H'67'; Boot Block size is 13312 words
_BBSIZE_BBSIZE_13184_7 EQU  H'66'; Boot Block size is 13184 words
_BBSIZE_BBSIZE_13056_7 EQU  H'65'; Boot Block size is 13056 words
_BBSIZE_BBSIZE_12928_7 EQU  H'64'; Boot Block size is 12928 words
_BBSIZE_BBSIZE_12800_7 EQU  H'63'; Boot Block size is 12800 words
_BBSIZE_BBSIZE_12672_7 EQU  H'62'; Boot Block size is 12672 words
_BBSIZE_BBSIZE_12544_7 EQU  H'61'; Boot Block size is 12544 words
_BBSIZE_BBSIZE_12416_7 EQU  H'60'; Boot Block size is 12416 words
_BBSIZE_BBSIZE_12288_7 EQU  H'5F'; Boot Block size is 12288 words
_BBSIZE_BBSIZE_12160_7 EQU  H'5E'; Boot Block size is 12160 words
_BBSIZE_BBSIZE_12032_7 EQU  H'5D'; Boot Block size is 12032 words
_BBSIZE_BBSIZE_11904_7 EQU  H'5C'; Boot Block size is 11904 words
_BBSIZE_BBSIZE_11776_7 EQU  H'5B'; Boot Block size is 11776 words
_BBSIZE_BBSIZE_11648_7 EQU  H'5A'; Boot Block size is 11648 words
_BBSIZE_BBSIZE_11520_7 EQU  H'59'; Boot Block size is 11520 words
_BBSIZE_BBSIZE_11392_7 EQU  H'58'; Boot Block size is 11392 words
_BBSIZE_BBSIZE_11264_7 EQU  H'57'; Boot Block size is 11264 words
_BBSIZE_BBSIZE_11136_7 EQU  H'56'; Boot Block size is 11136 words
_BBSIZE_BBSIZE_11008_7 EQU  H'55'; Boot Block size is 11008 words
_BBSIZE_BBSIZE_10880_7 EQU  H'54'; Boot Block size is 10880 words
_BBSIZE_BBSIZE_10752_7 EQU  H'53'; Boot Block size is 10752 words
_BBSIZE_BBSIZE_10624_7 EQU  H'52'; Boot Block size is 10624 words
_BBSIZE_BBSIZE_10496_7 EQU  H'51'; Boot Block size is 10496 words
_BBSIZE_BBSIZE_10368_7 EQU  H'50'; Boot Block size is 10368 words
_BBSIZE_BBSIZE_10240_7 EQU  H'4F'; Boot Block size is 10240 words
_BBSIZE_BBSIZE_10112_7 EQU  H'4E'; Boot Block size is 10112 words
_BBSIZE_BBSIZE_9984_7 EQU  H'4D'; Boot Block size is 9984 words
_BBSIZE_BBSIZE_9856_7 EQU  H'4C'; Boot Block size is 9856 words
_BBSIZE_BBSIZE_9728_7 EQU  H'4B'; Boot Block size is 9728 words
_BBSIZE_BBSIZE_9600_7 EQU  H'4A'; Boot Block size is 9600 words
_BBSIZE_BBSIZE_9472_7 EQU  H'49'; Boot Block size is 9472 words
_BBSIZE_BBSIZE_9344_7 EQU  H'48'; Boot Block size is 9344 words
_BBSIZE_BBSIZE_9216_7 EQU  H'47'; Boot Block size is 9216 words
_BBSIZE_BBSIZE_9088_7 EQU  H'46'; Boot Block size is 9088 words
_BBSIZE_BBSIZE_8960_7 EQU  H'45'; Boot Block size is 8960 words
_BBSIZE_BBSIZE_8832_7 EQU  H'44'; Boot Block size is 8832 words
_BBSIZE_BBSIZE_8704_7 EQU  H'43'; Boot Block size is 8704 words
_BBSIZE_BBSIZE_8576_7 EQU  H'42'; Boot Block size is 8576 words
_BBSIZE_BBSIZE_8448_7 EQU  H'41'; Boot Block size is 8448 words
_BBSIZE_BBSIZE_8320_7 EQU  H'40'; Boot Block size is 8320 words
_BBSIZE_BBSIZE_8192_7 EQU  H'3F'; Boot Block size is 8192 words
_BBSIZE_BBSIZE_8064_7 EQU  H'3E'; Boot Block size is 8064 words
_BBSIZE_BBSIZE_7936_7 EQU  H'3D'; Boot Block size is 7936 words
_BBSIZE_BBSIZE_7808_7 EQU  H'3C'; Boot Block size is 7808 words
_BBSIZE_BBSIZE_7680_7 EQU  H'3B'; Boot Block size is 7680 words
_BBSIZE_BBSIZE_7552_7 EQU  H'3A'; Boot Block size is 7552 words
_BBSIZE_BBSIZE_7424_7 EQU  H'39'; Boot Block size is 7424 words
_BBSIZE_BBSIZE_7296_7 EQU  H'38'; Boot Block size is 7296 words
_BBSIZE_BBSIZE_7168_7 EQU  H'37'; Boot Block size is 7168 words
_BBSIZE_BBSIZE_7040_7 EQU  H'36'; Boot Block size is 7040 words
_BBSIZE_BBSIZE_6912_7 EQU  H'35'; Boot Block size is 6912 words
_BBSIZE_BBSIZE_6784_7 EQU  H'34'; Boot Block size is 6784 words
_BBSIZE_BBSIZE_6656_7 EQU  H'33'; Boot Block size is 6656 words
_BBSIZE_BBSIZE_6528_7 EQU  H'32'; Boot Block size is 6528 words
_BBSIZE_BBSIZE_6400_7 EQU  H'31'; Boot Block size is 6400 words
_BBSIZE_BBSIZE_6272_7 EQU  H'30'; Boot Block size is 6272 words
_BBSIZE_BBSIZE_6144_7 EQU  H'2F'; Boot Block size is 6144 words
_BBSIZE_BBSIZE_6016_7 EQU  H'2E'; Boot Block size is 6016 words
_BBSIZE_BBSIZE_5888_7 EQU  H'2D'; Boot Block size is 5888 words
_BBSIZE_BBSIZE_5760_7 EQU  H'2C'; Boot Block size is 5760 words
_BBSIZE_BBSIZE_5632_7 EQU  H'2B'; Boot Block size is 5632 words
_BBSIZE_BBSIZE_5504_7 EQU  H'2A'; Boot Block size is 5504 words
_BBSIZE_BBSIZE_5376_7 EQU  H'29'; Boot Block size is 5376 words
_BBSIZE_BBSIZE_5248_7 EQU  H'28'; Boot Block size is 5248 words
_BBSIZE_BBSIZE_5120_7 EQU  H'27'; Boot Block size is 5120 words
_BBSIZE_BBSIZE_4992_7 EQU  H'26'; Boot Block size is 4992 words
_BBSIZE_BBSIZE_4864_7 EQU  H'25'; Boot Block size is 4864 words
_BBSIZE_BBSIZE_4736_7 EQU  H'24'; Boot Block size is 4736 words
_BBSIZE_BBSIZE_4608_7 EQU  H'23'; Boot Block size is 4608 words
_BBSIZE_BBSIZE_4480_7 EQU  H'22'; Boot Block size is 4480 words
_BBSIZE_BBSIZE_4352_7 EQU  H'21'; Boot Block size is 4352 words
_BBSIZE_BBSIZE_4224_7 EQU  H'20'; Boot Block size is 4224 words
_BBSIZE_BBSIZE_4096_7 EQU  H'1F'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_3968_7 EQU  H'1E'; Boot Block size is 3968 words
_BBSIZE_BBSIZE_3840_7 EQU  H'1D'; Boot Block size is 3840 words
_BBSIZE_BBSIZE_3712_7 EQU  H'1C'; Boot Block size is 3712 words
_BBSIZE_BBSIZE_3584_7 EQU  H'1B'; Boot Block size is 3584 words
_BBSIZE_BBSIZE_3456_7 EQU  H'1A'; Boot Block size is 3456 words
_BBSIZE_BBSIZE_3328_7 EQU  H'19'; Boot Block size is 3328 words
_BBSIZE_BBSIZE_3200_7 EQU  H'18'; Boot Block size is 3200 words
_BBSIZE_BBSIZE_3072_7 EQU  H'17'; Boot Block size is 3072 words
_BBSIZE_BBSIZE_2944_7 EQU  H'16'; Boot Block size is 2944 words
_BBSIZE_BBSIZE_2816_7 EQU  H'15'; Boot Block size is 2816 words
_BBSIZE_BBSIZE_2688_7 EQU  H'14'; Boot Block size is 2688 words
_BBSIZE_BBSIZE_2560_7 EQU  H'13'; Boot Block size is 2560 words
_BBSIZE_BBSIZE_2432_7 EQU  H'12'; Boot Block size is 2432 words
_BBSIZE_BBSIZE_2304_7 EQU  H'11'; Boot Block size is 2304 words
_BBSIZE_BBSIZE_2176_7 EQU  H'10'; Boot Block size is 2176 words
_BBSIZE_BBSIZE_2048_7 EQU  H'F0'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1920_7 EQU  H'E0'; Boot Block size is 1920 words
_BBSIZE_BBSIZE_1792_7 EQU  H'D0'; Boot Block size is 1792 words
_BBSIZE_BBSIZE_1664_7 EQU  H'C0'; Boot Block size is 1664 words
_BBSIZE_BBSIZE_1536_7 EQU  H'B0'; Boot Block size is 1536 words
_BBSIZE_BBSIZE_1408_7 EQU  H'A0'; Boot Block size is 1408 words
_BBSIZE_BBSIZE_1280_7 EQU  H'90'; Boot Block size is 1280 words
_BBSIZE_BBSIZE_1152_7 EQU  H'80'; Boot Block size is 1152 words
_BBSIZE_BBSIZE_1024_7 EQU  H'70'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_896_7 EQU  H'60'; Boot Block size is 896 words
_BBSIZE_BBSIZE_768_7 EQU  H'50'; Boot Block size is 768 words
_BBSIZE_BBSIZE_640_7 EQU  H'40'; Boot Block size is 640 words
_BBSIZE_BBSIZE_512_7 EQU  H'30'; Boot Block size is 512 words
_BBSIZE_BBSIZE_384_7 EQU  H'20'; Boot Block size is 384 words
_BBSIZE_BBSIZE_256_7 EQU  H'10'; Boot Block size is 256 words
_BBSIZE_BBSIZE_128_7 EQU  H'00'; Boot Block size is 128 words

;----- CONFIG8 Options --------------------------------------------------
_SAFSZ_SAFSZ_NONE_8  EQU  H'FF'; NONE
_SAFSZ_SAFSZ_128_8   EQU  H'FE'; Last 128 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_256_8   EQU  H'FC'; Last 256 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_384_8   EQU  H'F8'; Last 384 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_512_8   EQU  H'F0'; Last 512 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_640_8   EQU  H'E0'; Last 640 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_768_8   EQU  H'C0'; Last 768 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_896_8   EQU  H'80'; Last 896 words of PFM; self write operation depends on WRTSAF bit in CONFIG9
_SAFSZ_SAFSZ_1024_8  EQU  H'00'; Last 1024 words of PFM; self write operation depends on WRTSAF bit in CONFIG9

